pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_5xxxx_FWLib_v011_4188/utilities/common/ebi_lcd.c
/*********************************************************************************************************//**
 * @file    ebi_lcd.c
 * @version $Rev:: 1736         $
 * @date    $Date:: 2017-08-25 #$
 * @brief   This file provides a set of functions needed to manage the
 *          communication between EBI peripheral and LCD.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "ebi_lcd.h"
#include "font.h"

/** @addtogroup Utilities
  * @{
  */

/** @addtogroup Common
  * @{
  */

/** @addtogroup EBI_LCD EBI_LCD
  * @brief This file provides a set of functions needed to manage the
  *        communication between EBI peripheral and LCD.
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup EBI_LCD_Private_Define EBI LCD private definitions
  * @{
  */
#if (LCD_DIRECTION == LCD_NORMAL)
  #define EC (320)
  #define EP (240)
  #define MAC (0x60)
#elif (LCD_DIRECTION == LCD_LEFT_90)
  #define EC (240)
  #define EP (320)
  #define MAC (0x00)
#elif (LCD_DIRECTION == LCD_RIGHT_90)
  #define EC (240)
  #define EP (320)
  #define MAC (0xC0)
#elif (LCD_DIRECTION == LCD_ROTATE_180)
  #define EC (320)
  #define EP (240)
  #define MAC (0xA0)
#endif
/**
  * @}
  */

/* Private variables ---------------------------------------------------------------------------------------*/
/** @defgroup EBI_LCD_Private_Variable EBI LCD private variables
  * @{
  */
static u16 Color_Text = 0x0000;  // default: Black
static u16 Color_Back = 0xFFFF;  // default: White
static vu32 DelayTime = 0;
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------------------------------------*/
static void _delay(u32 nCount);

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup EBI_LCD_Exported_Functions EBI LCD exported functions
  * @{
  */
/*********************************************************************************************************//**
  * @brief  Initialize peripherals used by the EBI LCD driver.
  * @retval None
  ***********************************************************************************************************/
void LCD_Init(void)
{
  EBI_InitTypeDef  EBI_InitStructure;

  /*  Enable AFIO clock                                                                                     */
  /*  Enable EBI & EBI CS port clock                                                                        */
  CKCU_PeripClockConfig_TypeDef CKCUClock = {{0}};
  LCD_EBI_RST_CLK(CKCUClock) = 1;
  #if (LCD_EBI_BL_ENABLE == 1)
  LCD_EBI_BL_CLK(CKCUClock)  = 1;
  #endif
  CKCUClock.Bit.EBI          = 1;
  CKCUClock.Bit.AFIO         = 1;
  CKCU_PeripClockConfig(CKCUClock, ENABLE);

  /* Configure EBI pins & LCD RESET pin                                                                     */
  HT32F_DVB_GPxConfig(LCD_EBI_CS_GPIO_ID, LCD_EBI_CS_AFIO_PIN, LCD_EBI_CS_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_OE_GPIO_ID, LCD_EBI_OE_AFIO_PIN, LCD_EBI_OE_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_WE_GPIO_ID, LCD_EBI_WE_AFIO_PIN, LCD_EBI_WE_AFIO_MODE);
  #if (SPIDUALOUT_WITH_EBI_8BIT_MODE == 0)
  HT32F_DVB_GPxConfig(LCD_EBI_RS_GPIO_ID, LCD_EBI_RS_AFIO_PIN, LCD_EBI_RS_AFIO_MODE);
  #else
  HT32F_DVB_GPxConfig(LCD_EBI_RS1_GPIO_ID, LCD_EBI_RS1_AFIO_PIN, LCD_EBI_RS1_AFIO_MODE);
  #endif
  HT32F_DVB_GPxConfig(LCD_EBI_AD0_GPIO_ID, LCD_EBI_AD0_AFIO_PIN, LCD_EBI_AD0_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD1_GPIO_ID, LCD_EBI_AD1_AFIO_PIN, LCD_EBI_AD1_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD2_GPIO_ID, LCD_EBI_AD2_AFIO_PIN, LCD_EBI_AD2_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD3_GPIO_ID, LCD_EBI_AD3_AFIO_PIN, LCD_EBI_AD3_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD4_GPIO_ID, LCD_EBI_AD4_AFIO_PIN, LCD_EBI_AD4_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD5_GPIO_ID, LCD_EBI_AD5_AFIO_PIN, LCD_EBI_AD5_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD6_GPIO_ID, LCD_EBI_AD6_AFIO_PIN, LCD_EBI_AD6_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD7_GPIO_ID, LCD_EBI_AD7_AFIO_PIN, LCD_EBI_AD7_AFIO_MODE);
  #if (LCD_BIT_MODE == LCD_16_BIT_MODE)
  HT32F_DVB_GPxConfig(LCD_EBI_AD8_GPIO_ID, LCD_EBI_AD8_AFIO_PIN, LCD_EBI_AD8_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD9_GPIO_ID, LCD_EBI_AD9_AFIO_PIN, LCD_EBI_AD9_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD10_GPIO_ID, LCD_EBI_AD10_AFIO_PIN, LCD_EBI_AD10_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD11_GPIO_ID, LCD_EBI_AD11_AFIO_PIN, LCD_EBI_AD11_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD12_GPIO_ID, LCD_EBI_AD12_AFIO_PIN, LCD_EBI_AD12_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD13_GPIO_ID, LCD_EBI_AD13_AFIO_PIN, LCD_EBI_AD13_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD14_GPIO_ID, LCD_EBI_AD14_AFIO_PIN, LCD_EBI_AD14_AFIO_MODE);
  HT32F_DVB_GPxConfig(LCD_EBI_AD15_GPIO_ID, LCD_EBI_AD15_AFIO_PIN, LCD_EBI_AD15_AFIO_MODE);
  #endif
  #if (LCD_EBI_BL_ENABLE == 1)
  HT32F_DVB_GPxConfig(LCD_EBI_BL_GPIO_ID, LCD_EBI_BL_GPIO_PIN, LCD_EBI_BL_AFIO_MODE);
  #endif
  HT32F_DVB_GPxConfig(LCD_EBI_RST_GPIO_ID, LCD_EBI_RST_GPIO_PIN, LCD_EBI_RST_AFIO_MODE);

  /* Set output data of RESET as high                                                                       */
  GPIO_SetOutBits(GPIO_PORT[LCD_EBI_RST_GPIO_ID], LCD_EBI_RST_GPIO_PIN);

