pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_5xxxx_FWLib_v011_4188/utilities/common/ebi_lcd.c
  /* Configure the direction of BL as output mode                                                           */
  #if (LCD_EBI_BL_ENABLE == 1)
  GPIO_DirectionConfig(GPIO_PORT[LCD_SPI_BL_GPIO_ID], LCD_SPI_BL_GPIO_PIN, GPIO_DIR_OUT);
  #endif

  /* Configure the direction of RESET as output mode                                                        */
  GPIO_DirectionConfig(GPIO_PORT[LCD_EBI_RST_GPIO_ID], LCD_EBI_RST_GPIO_PIN, GPIO_DIR_OUT);

  /*  EBI Configuration                                                                                     */
  EBI_InitStructure.EBI_Bank = EBI_BANK_0;
  #if (LCD_BIT_MODE==LCD_16_BIT_MODE)
  EBI_InitStructure.EBI_Mode = EBI_MODE_D16;
  #else
  EBI_InitStructure.EBI_Mode = EBI_MODE_D8A8;
  #endif
#if (EBI_FUN_BYTELAND == 1)
  EBI_InitStructure.EBI_ByteLane = EBI_BYTELANE_DISABLE;
  EBI_InitStructure.EBI_ByteLanePolarity = EBI_BYTELANEPOLARITY_LOW;
#endif
  EBI_InitStructure.EBI_IdleCycle = EBI_IDLECYCLE_DISABLE;
#if(EBI_FUN_ASYNCREADY == 1)
  EBI_InitStructure.EBI_AsynchronousReady = EBI_ASYNCHRONOUSREADY_DISABLE;
  EBI_InitStructure.EBI_ARDYTimeOut = EBI_ARDYTIMEOUT_DISABLE;
  EBI_InitStructure.EBI_ReadySignalPolarity = EBI_READYSIGNALPOLARITY_LOW;
#endif
  EBI_InitStructure.EBI_ChipSelectPolarity = EBI_CHIPSELECTPOLARITY_LOW;
  EBI_InitStructure.EBI_AddressLatchPolarity = EBI_ADDRESSLATCHPOLARITY_LOW;
  EBI_InitStructure.EBI_WriteEnablePolarity = EBI_WRITEENABLEPOLARITY_LOW;
  EBI_InitStructure.EBI_ReadEnablePolarity = EBI_READENABLEPOLARITY_LOW;
  EBI_InitStructure.EBI_IdleCycleTime = 0;
  EBI_InitStructure.EBI_AddressSetupTime = 0;
  EBI_InitStructure.EBI_AddressHoldTime = 0;
  EBI_InitStructure.EBI_WriteSetupTime = 2;
  EBI_InitStructure.EBI_WriteStrobeTime = 2;
  EBI_InitStructure.EBI_WriteHoldTime = 1;
  EBI_InitStructure.EBI_ReadSetupTime = 2;
  EBI_InitStructure.EBI_ReadStrobeTime = 5;
  EBI_InitStructure.EBI_ReadHoldTime = 1;
  EBI_Init(&EBI_InitStructure);

  EBI_Cmd(EBI_BANK_0, ENABLE);
}

/*********************************************************************************************************//**
  * @brief  Configures the LCD by the EBI lcd driver.
  * @retval None
  ***********************************************************************************************************/
void LCD_Config(void)
{
  _delay(10);

  /* RESET LCD                                                                                              */
  GPIO_ClearOutBits(GPIO_PORT[LCD_EBI_RST_GPIO_ID], LCD_EBI_RST_GPIO_PIN);
  _delay(10);
  GPIO_SetOutBits(GPIO_PORT[LCD_EBI_RST_GPIO_ID], LCD_EBI_RST_GPIO_PIN);
  _delay(15);

  EBI_LCD->EBI_LCD_REG = 0xE0;  // PLL enable
  EBI_LCD->EBI_LCD_RAM = 0x01;
  _delay(10);

  /* Driving ability Setting                                                                                */
  LCD_WriteReg(0xE2, 0x00);
  LCD_WriteReg(0xE4, 0x01);
  LCD_WriteReg(0xE5, 0x10);
  LCD_WriteReg(0xE6, 0x01);
  LCD_WriteReg(0xE7, 0x10);
  LCD_WriteReg(0xE8, 0x70);
  LCD_WriteReg(0xF2, 0x00);
  LCD_WriteReg(0xEA, 0x00);
  LCD_WriteReg(0xEB, 0x20);
  LCD_WriteReg(0xEC, 0x3C);
  LCD_WriteReg(0xED, 0xC8);
  LCD_WriteReg(0xE9, 0x38);
  LCD_WriteReg(0xF1, 0x01);
  LCD_WriteReg(0x2E, 0x89);
  LCD_WriteReg(0x29, 0x8F);
  LCD_WriteReg(0x2B, 0x02);

  /* Gamma 2.2 Setting                                                                                      */
  LCD_WriteReg(0x40, 0x00);
  LCD_WriteReg(0x41, 0x00);
  LCD_WriteReg(0x42, 0x00);
  LCD_WriteReg(0x43, 0x15);
  LCD_WriteReg(0x44, 0x13);
  LCD_WriteReg(0x45, 0x3f);
  LCD_WriteReg(0x47, 0x55);
  LCD_WriteReg(0x48, 0x00);
  LCD_WriteReg(0x49, 0x12);
  LCD_WriteReg(0x4A, 0x19);
  LCD_WriteReg(0x4B, 0x19);
  LCD_WriteReg(0x4C, 0x16);
  LCD_WriteReg(0x50, 0x00);
  LCD_WriteReg(0x51, 0x2c);
  LCD_WriteReg(0x52, 0x2a);
  LCD_WriteReg(0x53, 0x3F);
  LCD_WriteReg(0x54, 0x3F);
  LCD_WriteReg(0x55, 0x3F);
  LCD_WriteReg(0x56, 0x2a);
  LCD_WriteReg(0x57, 0x7e);
  LCD_WriteReg(0x58, 0x09);
  LCD_WriteReg(0x59, 0x06);
  LCD_WriteReg(0x5A, 0x06);
  LCD_WriteReg(0x5B, 0x0d);
  LCD_WriteReg(0x5C, 0x1F);
  LCD_WriteReg(0x5D, 0xFF);

  /* Power Voltage Setting                                                                                  */
  LCD_WriteReg(0x1B, 0x1A);
  LCD_WriteReg(0x1A, 0x02);
  LCD_WriteReg(0x24, 0x61);
  LCD_WriteReg(0x25, 0x5C);

  /* VCOM offset                                                                                            */
  LCD_WriteReg(0x18, 0x36);
  LCD_WriteReg(0x19, 0x01);
  LCD_WriteReg(0x23, 0x62);
  LCD_WriteReg(0x1F, 0x88);
  _delay(5);
  LCD_WriteReg(0x1F, 0x80);
  _delay(5);
  LCD_WriteReg(0x1F, 0x90);
  _delay(5);
  LCD_WriteReg(0x1F, 0xD4);
  _delay(5);

  /* 262k or 65k color selection                                                                            */
  LCD_WriteReg(0x17, 0x05);

  LCD_WriteReg(0x36, 0x09);

  /* Display ON Setting                                                                                     */
  LCD_WriteReg(0x28, 0x38);
  _delay(40);
  LCD_WriteReg(0x28, 0x3C);

  /* Set GRAM Area                                                                                          */
  // Column Start
  LCD_WriteReg(0x02, 0x00);
  LCD_WriteReg(0x03, 0x00);

  // Column End
  LCD_WriteReg(0x04, ((EC - 1) & 0xFF00) >> 8);
  LCD_WriteReg(0x05, ((EC - 1) & 0xFF));

  // Row Start
  LCD_WriteReg(0x06, 0x00);
  LCD_WriteReg(0x07, 0x00);

  // Row End
  LCD_WriteReg(0x08, ((EP - 1) & 0xFF00) >> 8);
  LCD_WriteReg(0x09, ((EP - 1) & 0xFF));

  /* Show Direction                                                                                         */
  LCD_WriteReg(0x16, MAC);

  LCD_Clear(Black);

  _delay(200);

  /* Turn on the back light                                                                                 */
  #if (LCD_EBI_BL_ENABLE == 1)
  GPIO_SetOutBits(GPIO_PORT[LCD_EBI_BL_GPIO_ID], LCD_EBI_BL_GPIO_PIN);
  #endif
}

/*********************************************************************************************************//**
  * @brief  Write value to the selected LCD register.
  * @param  LCD_Reg_Index: address of the selected register.
  * @param  LCD_Reg_Value: value of to write the selected register.
  * @retval None
  ***********************************************************************************************************/
void LCD_WriteReg(u32 LCD_Reg_Index, u32 LCD_Reg_Value)
{
  EBI_LCD->EBI_LCD_REG = LCD_Reg_Index;
  EBI_LCD->EBI_LCD_RAM = LCD_Reg_Value;
}

