pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_5xxxx_FWLib_v011_4188/utilities/common/ebi_lcd.c
/*********************************************************************************************************//**
  * @brief  Read value from the selected LCD register.
  * @param  LCD_Reg_Index: address of the selected register.
  * @retval EBI_LCD->EBI_LCD_RAM
  ***********************************************************************************************************/
u16 LCD_ReadReg(u32 LCD_Reg_Index)
{
  EBI_LCD->EBI_LCD_REG = LCD_Reg_Index;
  return (EBI_LCD->EBI_LCD_RAM);
}

/*********************************************************************************************************//**
  * @brief  Set the cursor position.
  * @param  X_Location: specify the X position.
  * @param  Y_Location: specify the Y position.
  * @retval None
  ***********************************************************************************************************/
void LCD_StarterSet(u32 X_Location, u32 Y_Location)
{
  LCD_WriteReg(REG6, ((X_Location >> 8) & 0xff));
  LCD_WriteReg(REG7, (X_Location & 0xff));

  LCD_WriteReg(REG2, ((Y_Location >> 8) & 0xff));
  LCD_WriteReg(REG3, (Y_Location & 0xff));
}

/*********************************************************************************************************//**
  * @brief  Prepare to write data to LCD RAM.
  * @retval None
  ***********************************************************************************************************/
void LCD_WriteRAMPrior(void)
{
  EBI_LCD->EBI_LCD_REG = REG34;
}

/*********************************************************************************************************//**
  * @brief  Write to the LCD RAM.
  * @param  RGB_Set: the pixel color in RGB mode (5-6-5).
  * @retval None
  ***********************************************************************************************************/
void LCD_WriteRAM(u32 RGB_Set)
{
  #if (LCD_BIT_MODE==LCD_16_BIT_MODE)
  EBI_LCD->EBI_LCD_RAM = RGB_Set;
  #else
  EBI_LCD->EBI_LCD_RAM = (RGB_Set >> 8) & 0x00FF;
  EBI_LCD->EBI_LCD_RAM = RGB_Set & 0xFF;
  #endif
}

/*********************************************************************************************************//**
  * @brief  Clear the whole LCD.
  * @param  Color: the color to be the background.
  * @retval None
  ***********************************************************************************************************/
void LCD_Clear(u16 Color)
{
  u32 i = LCD_Height * LCD_Width;

  LCD_StarterSet(0, 0);

  /* Prepare to write GRAM                                                                                  */
  LCD_WriteRAMPrior();

  while (i--)
  {
    #if (LCD_BIT_MODE==LCD_16_BIT_MODE)
    EBI_LCD->EBI_LCD_RAM = Color;
    #else
    EBI_LCD->EBI_LCD_RAM = (Color >> 8) & 0x00FF;
    EBI_LCD->EBI_LCD_RAM = Color & 0xFF;
    #endif
  }
}

/*********************************************************************************************************//**
  * @brief  Set the background color.
  * @param  Color: background color of RGB 5-6-5.
  * @retval None
  ***********************************************************************************************************/
void LCD_BackColorSet(u16 Color)
{
  Color_Back = Color;
}

/*********************************************************************************************************//**
  * @brief  Set the text color.
  * @param  Color: text color of RGB 5-6-5.
  * @retval None
  ***********************************************************************************************************/
void LCD_TextColorSet(u16 Color)
{
  Color_Text = Color;
}

/*********************************************************************************************************//**
  * @brief  Display one character (16 dots width, 24 dots height).
  * @param  Line_Num: Where to display the character, should be LINE0 ~ LINE9.
  * @param  Column: start column address.
  * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
  * @retval None
  ***********************************************************************************************************/
void LCD_CharDisplay(u32 Line_Num, u32 Column, u32 Ascii)
{
  Ascii -= 32;
  LCD_CharDraw(Line_Num, Column, (u16 *)&ASCII_Font_Table[Ascii * 24]);
}

/*********************************************************************************************************//**
  * @brief  Disable the Display.
  * @retval None
  ***********************************************************************************************************/
void LCD_DisplayOff(void)
{
  /* Display Off                                                                                            */
  LCD_WriteReg(REG40, 0);
}

/*********************************************************************************************************//**
  * @brief  Enable the Display.
  * @retval None
  ***********************************************************************************************************/
void LCD_DisplayOn(void)
{
  /* Display On                                                                                             */
  LCD_WriteReg(REG40, 0x3C);
}

/*********************************************************************************************************//**
  * @brief  Display the maximum 20 characters on one line.
  * @param  Line_Num: Where to display the character, should be LINE0 ~ LINE9.
  * @param  Sptr: point to the string data.
  * @retval None
  ***********************************************************************************************************/
void LCD_StringLineDisplay(u32 Line_Num, char *Sptr)
{
  u32 i = 0;
  u16 reference_column = 0;

  /* Send character by character on LCD                                                                     */
  while ((*Sptr != 0) & (i < 20))
  {
    LCD_CharDisplay(Line_Num, reference_column, *Sptr);
    /* Increment the column position by 16, because character is size of 16x24                              */
    reference_column += 16;
    /* Point to the next character                                                                          */
    Sptr++;

    /* Increase the character counter                                                                       */
    i++;
  }
}

