pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_5xxxx_FWLib_v011_4188/utilities/common/ebi_lcd.c
/*********************************************************************************************************//**
  * @brief  Draw one character.
  * @param  X_Location: the position of display line, should be LINE0 ~ LINE9.
  * @param  Y_Location: the start position of character.
  * @param  Cptr: point to font data of character.
  * @retval None
  ***********************************************************************************************************/
void LCD_CharDraw(u32 X_Location, u32 Y_Location, u16 *Cptr)
{
  u32 xid = X_Location;
  u32 i = 0, j = 0;

  LCD_StarterSet(X_Location, Y_Location);

  for (i = 0; i < Font_Raw; i++)
  {
    LCD_WriteRAMPrior();  // Get ready to write GRAM
    for (j = 0; j < Font_Column; j++)
    {
      if ((Cptr[i] & (1 << j)) == 0x00)
      {
        LCD_WriteRAM(Color_Back);
      }
      else
      {
        LCD_WriteRAM(Color_Text);
      }
    }
    xid++;
    LCD_StarterSet(xid, Y_Location);
  }
}

/*********************************************************************************************************//**
  * @brief  Display a line.
  * @param  X_Location: specify the X position.
  * @param  Y_Location: specify the Y position.
  * @param  Length: line length.
  * @param  Direction: line direction.
  *   This parameter can be one of the following values:
  *     @arg Vertical
  *     @arg Horizontal
  * @retval None
  ***********************************************************************************************************/
void LCD_LineDraw(u32 X_Location, u32 Y_Location, u32 Length, u32 Direction)
{
  s32 i = 0;

  LCD_StarterSet(X_Location, Y_Location);

  if (Direction == Horizontal)
  {
    LCD_WriteRAMPrior();  // Get ready to write GRAM
    for (i = Length; i > 0; i--)
    {
      LCD_WriteRAM(Color_Text);
    }
  }
  else
  {
    for (i = Length; i > 0; i--)
    {
      LCD_WriteRAMWord(Color_Text);
      X_Location++;
      LCD_StarterSet(X_Location, Y_Location);
    }
  }
}

/*********************************************************************************************************//**
  * @brief  Display a circle.
  * @param  X_Location: specify the X position.
  * @param  Y_Location: specify the Y position.
  * @param  Radius: radius of the circle.
  * @retval None
  ***********************************************************************************************************/
void LCD_CircleDraw(u32 X_Location, u32 Y_Location, u32 Radius)
{
  s32  DV;  // Decision Variable
  u32  X_Value;      // Current X Value
  u32  Y_Value;      // Current Y Value

  DV = 3 - (Radius << 1);
  X_Value = 0;
  Y_Value = Radius;

  while (X_Value <= Y_Value)
  {
    LCD_StarterSet(X_Location + X_Value, Y_Location + Y_Value);
    LCD_WriteRAMWord(Color_Text);

    LCD_StarterSet(X_Location + X_Value, Y_Location - Y_Value);
    LCD_WriteRAMWord(Color_Text);

    LCD_StarterSet(X_Location - X_Value, Y_Location + Y_Value);
    LCD_WriteRAMWord(Color_Text);

    LCD_StarterSet(X_Location - X_Value, Y_Location - Y_Value);
    LCD_WriteRAMWord(Color_Text);

    LCD_StarterSet(X_Location + Y_Value, Y_Location + X_Value);
    LCD_WriteRAMWord(Color_Text);

    LCD_StarterSet(X_Location + Y_Value, Y_Location - X_Value);
    LCD_WriteRAMWord(Color_Text);

    LCD_StarterSet(X_Location - Y_Value, Y_Location + X_Value);
    LCD_WriteRAMWord(Color_Text);

    LCD_StarterSet(X_Location - Y_Value, Y_Location - X_Value);
    LCD_WriteRAMWord(Color_Text);

    if (DV < 0)
    {
      DV += (X_Value << 2) + 6;
    }
    else
    {
      DV += ((X_Value - Y_Value) << 2) + 10;
      Y_Value--;
    }
    X_Value++;
  }
}

/*********************************************************************************************************//**
  * @brief  Draw a rectangle.
  * @param  X_Location: X position.
  * @param  Y_Location: Y position.
  * @param  Height: rectangle height.
  * @param  Width: rectangle width.
  * @retval None
  ***********************************************************************************************************/
void LCD_RectDraw(u32 X_Location, u32 Y_Location, u32 Height, u32 Width)
{
  LCD_LineDraw(X_Location, Y_Location, Width, Horizontal);
  LCD_LineDraw((X_Location + Height), Y_Location, Width, Horizontal);

  LCD_LineDraw(X_Location, Y_Location, Height, Vertical);
  LCD_LineDraw(X_Location, Y_Location + Width - 1, Height, Vertical);
}

/*********************************************************************************************************//**
  * @brief  Draw a picture.
  * @param  X_Location: X position.
  * @param  Y_Location: Y position.
  * @param  Height: rectangle height.
  * @param  Width: rectangle width.
  * @param  Pptr: point to pixel data of picture.
  * @retval None
  ***********************************************************************************************************/
void LCD_PicDraw(u8 X_Location, u16 Y_Location, u8 Height, u16 Width, uc8 *Pptr)
{
  u32 xid = 0;
  u32 ImgAdds = 0;
  u32 yid = 0;
  u32 i = 0, j = 0, color = 0;

  xid = Height + X_Location;
  yid = Y_Location;
  LCD_StarterSet(xid, yid);

  for (i = 0; i < Height; i++)
  {
    LCD_WriteRAMPrior();  // Get ready to write GRAM

    for (j = 0; j < Width; j++)
    {
      ImgAdds = (i * Width * 2) + (j * 2);

      color = Pptr[ImgAdds] << 8 | (Pptr[ImgAdds + 1]);

      LCD_WriteRAM(color);
    }
    xid--;
    LCD_StarterSet(xid, yid);
  }
}

/*********************************************************************************************************//**
  * @brief  Write 1 word to the LCD RAM.
  * @param  RGB_Set: the pixel color in RGB mode (5-6-5).
  * @retval None
  ***********************************************************************************************************/
void LCD_WriteRAMWord(u32 RGB_Set)
{
  LCD_WriteRAMPrior();

  LCD_WriteRAM(RGB_Set);
}

/*********************************************************************************************************//**
  * @brief  Set Display Area.
  * @param  Column:
  * @param  Page:
  * @param  Height:
  * @param  Width:
  * @retval None
  ***********************************************************************************************************/
void LCD_SetDisplayArea(u16 Column, u16 Page, u16 Height, u16 Width)
{
  EBI_LCD->EBI_LCD_REG = REG2;
  EBI_LCD->EBI_LCD_RAM = (Page >> 8) & 0xFF;

  EBI_LCD->EBI_LCD_REG = REG3;
  EBI_LCD->EBI_LCD_RAM = (Page & 0xFF);

  EBI_LCD->EBI_LCD_REG = REG4;
  EBI_LCD->EBI_LCD_RAM = ((Page + Width-1) >> 8) & 0xFF;

  EBI_LCD->EBI_LCD_REG = REG5;
  EBI_LCD->EBI_LCD_RAM = (Page + Width-1) & 0xFF;

  EBI_LCD->EBI_LCD_REG = REG6;
  EBI_LCD->EBI_LCD_RAM = (Column >> 8) & 0xFF;

  EBI_LCD->EBI_LCD_REG = REG7;
  EBI_LCD->EBI_LCD_RAM = (Column & 0xFF);

  EBI_LCD->EBI_LCD_REG = REG8;
  EBI_LCD->EBI_LCD_RAM = ((Column + Height-1) >> 8) & 0xFF;

  EBI_LCD->EBI_LCD_REG = REG9;
  EBI_LCD->EBI_LCD_RAM = (Column + Height-1) & 0xFF;
}
/**
  * @}
  */


/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup EBI_LCD_Private_Functions EBI LCD private functions
  * @{
  */
/*********************************************************************************************************//**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  ***********************************************************************************************************/
static void _delay(u32 nCount)
{
  vu32 i;

  for (i = 0; i < 10000 * nCount; i++)
  {
  }
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
